# How do I use the MultiIndex in pandas?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Sun 10 Jan 2021

In [28]:
import pandas as pd

In [29]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [30]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [31]:
# Let's look at the range index
stocks.index

RangeIndex(start=0, stop=9, step=1)


‚òùüèª It is a regular index not a multi index.

In [32]:
# Performing a groupby action : 
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64


‚òùüèª By performing such action, we determine for each symbol, what is the mean closing price.

In [33]:
# Passing a list now in a groupby action : 
ser = stocks.groupby(['Symbol', 'Date']).Close.mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64


‚òùüèª We have calculated here for each pair of symbol and date the mean closing price.


üßê This technique would have more meaning in scenario where you have two prices : entry and closing time or for a seasonal fashion article : off-sale price and on-sale price.

In [34]:
# Reading into the Serie multi index : 
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])


üßê A multi index effectively adds another dimension to this index. A Series is usually one dimensional but a Series with a multi index has two dimensions. 

A dataframe is normally bi-dimensional, but with a multi index, it comes as tri-dimensional.

In [35]:
# Unstacking a multi index Series to convert it into a dataframe : 
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64


üßê A multi index Series, being just like a dataframe is bi-dimensional, and can simply be read as a dataframe.

In [36]:
# Another path to obtain the same result : 
df = stocks.pivot_table(values='Close', index='Symbol', columns='Date')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [37]:
# Reminder : Reading our Series 
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [38]:
# Selecting data within a specific layer through the outer level : 
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [39]:
# Now extracting a specific date within our selection through both the outer and inner levels : 
ser.loc['AAPL', '2016-10-03']

112.52

In [40]:
# Now selecting a date and getting all data surrounding it through the inner level : 
ser.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [41]:
# Back to reading our original dataframe
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [46]:
# Applying our methods to a dataframe : 
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [48]:
# Selecting the rows and columns you need through a tupple (rows selection), and the :(columns selection):
stocks.loc[('AAPL', '2016-10-03'), :]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [49]:
# Selecting only the column close : 
stocks.loc[('AAPL', '2016-10-03'), 'Close']

112.52

In [50]:
# Selecting two different stocks for a specific day : 
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [52]:
# Selecting the close price for our latest selection : 
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [56]:
# Selecting multiple date for Apple stocks on close : 
stocks.loc[('AAPL', ['2016-10-03', '2016-10-04']), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
Name: Close, dtype: float64

In [60]:
# Selecting all Company stocks for these two dates : 
stocks.loc[(slice(None), ['2016-10-03', '2016-10-04']), :]

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400


‚≠êÔ∏è Now let's see how to concatenate on more than one level by operating a merging action on two dataframes ->

In [64]:
# Reading the first dataframe 
close = pd.read_csv('http://bit.ly/smallstocks', usecols=[0, 1, 3], index_col=['Symbol', 'Date','Close'])
close

Empty DataFrame
Columns: []
Index: [(CSCO, 2016-10-03, 31.5), (AAPL, 2016-10-03, 112.52), (MSFT, 2016-10-03, 57.42), (AAPL, 2016-10-04, 113.0), (MSFT, 2016-10-04, 57.24), (CSCO, 2016-10-04, 31.35), (MSFT, 2016-10-05, 57.64), (CSCO, 2016-10-05, 31.59), (AAPL, 2016-10-05, 113.05)]

In [66]:
# Reading the second dataframe : 
volume = pd.read_csv('http://bit.ly/smallstocks', usecols=[0, 2, 3], index_col=['Symbol', 'Date','Volume'])
volume

Empty DataFrame
Columns: []
Index: [(CSCO, 2016-10-03, 14070500), (AAPL, 2016-10-03, 21701800), (MSFT, 2016-10-03, 19189500), (AAPL, 2016-10-04, 29736800), (MSFT, 2016-10-04, 20085900), (CSCO, 2016-10-04, 18460400), (MSFT, 2016-10-05, 16726400), (CSCO, 2016-10-05, 11808600), (AAPL, 2016-10-05, 21453100)]

In [69]:
# Reading volume index
volume.index

MultiIndex([('CSCO', '2016-10-03', 14070500),
            ('AAPL', '2016-10-03', 21701800),
            ('MSFT', '2016-10-03', 19189500),
            ('AAPL', '2016-10-04', 29736800),
            ('MSFT', '2016-10-04', 20085900),
            ('CSCO', '2016-10-04', 18460400),
            ('MSFT', '2016-10-05', 16726400),
            ('CSCO', '2016-10-05', 11808600),
            ('AAPL', '2016-10-05', 21453100)],
           names=['Symbol', 'Date', 'Volume'])

In [70]:
# Reading close index
close.index

MultiIndex([('CSCO', '2016-10-03',   31.5),
            ('AAPL', '2016-10-03', 112.52),
            ('MSFT', '2016-10-03',  57.42),
            ('AAPL', '2016-10-04',  113.0),
            ('MSFT', '2016-10-04',  57.24),
            ('CSCO', '2016-10-04',  31.35),
            ('MSFT', '2016-10-05',  57.64),
            ('CSCO', '2016-10-05',  31.59),
            ('AAPL', '2016-10-05', 113.05)],
           names=['Symbol', 'Date', 'Close'])

In [67]:
# Now merging these two dataframes : 
merge = pd.merge(close, volume, left_index=True, right_index=True)
merge

Empty DataFrame
Columns: []
Index: [(CSCO, 2016-10-03, 31.5, 14070500), (AAPL, 2016-10-03, 112.52, 21701800), (MSFT, 2016-10-03, 57.42, 19189500), (AAPL, 2016-10-04, 113.0, 29736800), (MSFT, 2016-10-04, 57.24, 20085900), (CSCO, 2016-10-04, 31.35, 18460400), (MSFT, 2016-10-05, 57.64, 16726400), (CSCO, 2016-10-05, 31.59, 11808600), (AAPL, 2016-10-05, 113.05, 21453100)]

In [71]:
merge.index

MultiIndex([('CSCO', '2016-10-03',   31.5, 14070500),
            ('AAPL', '2016-10-03', 112.52, 21701800),
            ('MSFT', '2016-10-03',  57.42, 19189500),
            ('AAPL', '2016-10-04',  113.0, 29736800),
            ('MSFT', '2016-10-04',  57.24, 20085900),
            ('CSCO', '2016-10-04',  31.35, 18460400),
            ('MSFT', '2016-10-05',  57.64, 16726400),
            ('CSCO', '2016-10-05',  31.59, 11808600),
            ('AAPL', '2016-10-05', 113.05, 21453100)],
           names=['Symbol', 'Date', 'Close', 'Volume'])


‚úÖ We have successfully reconstructed our dataframe. This the method to use when having two dataframes with the same multi index but with a different column or columns and you wish yo combine them into one.


üôèüèª Thank you !

üëãüèª See you in the next one !